<?php
$hunter='охотник';  Объявляет строковую переменную $hunter и присваивает ей значение 'охотник'.
$wants='желает';    Объявляет строковую переменную $wants и присваивает ей значение 'желает'.
$knows='знать';     Объявляет строковую переменную $knows и присваивает ей значение 'знать'.
$fazan='фазан';     Объявляет строковую переменную $fazan и присваивает ей значение 'фазан'.
$sits='сидит';      Объявляет строковую переменную $sits и присваивает ей значение 'сидит'.

echo"Каждый $hunter $wants $knows где $sits $fazan";  Выводит строку, в которую PHP автоматически вставляет значения переменных, заключенных в двойные кавычки.

?>