<?php
 PHP-код начинается с открывающего тега.

$not_take_risks='Кто не рискует';  Объявляет строковую переменную $not_take_risks и присваивает ей значение 'Кто не рискует'.
$not_drink='Не пьет';            Объявляет строковую переменную $not_drink и присваивает ей значение 'Не пьет'.
$sellipsis='...';                 Объявляет строковую переменную $sellipsis и присваивает ей значение '...'.

echo"$not_take_risks тот $not_drink $sellipsis";  Выводит строку, в которую PHP автоматически вставляет значения переменных, заключенных в двойные кавычки.

?>