<?php
PHP-код начинается с открывающего тега.

$give='Дают';  Объявляет строковую переменную $give и присваивает ей значение 'Дают'.
$take='бери';   Объявляет строковую переменную $take и присваивает ей значение 'бери'.
$beat='бьют';   Объявляет строковую переменную $beat и присваивает ей значение 'бьют'.
$run='беги';    Объявляет строковую переменную $run и присваивает ей значение 'беги'.

echo "$give-$take,$beat-$run.";  Выводит строку, в которую PHP автоматически вставляет значения переменных, заключенных в двойные кавычки.

?>