<?php
 PHP-код начинается с открывающего тега.

$not_take_risks = 'Кто не рискует';  Объявляет строковую переменную $not_take_risks и присваивает ей значение 'Кто не рискует'.
$not_drink = 'не пьет';              Объявляет строковую переменную $not_drink и присваивает ей значение 'не пьет'.
$ellipsis = 'шампанское';            Объявляет строковую переменную $ellipsis и присваивает ей значение 'шампанское'.

echo $not_take_risks . ', ' . 'тот ' . $not_drink . ' ' . $ellipsis;  Выводит строку, используя оператор конкатенации '.' для объединения переменных и строковых литералов.

?>