<?php
 PHP-код начинается с открывающего тега.

$hunter = 'охотник';  Объявляет строковую переменную $hunter и присваивает ей значение 'охотник'.
$wants_to = 'желает';  Объявляет строковую переменную $wants_to и присваивает ей значение 'желает'.
$know = 'знать';      Объявляет строковую переменную $know и присваивает ей значение 'знать'.
$fizan = 'фазан';     Объявляет строковую переменную $fizan и присваивает ей значение 'фазан'.
$sits = 'сидит';      Объявляет строковую переменную $sits и присваивает ей значение 'сидит'.

echo 'каждый ' . $hunter . ' ' . $wants_to . ' ' . $know . ' ' . 'где ' . $sits . ' ' . $fizan;  Выводит строку, используя оператор конкатенации '.' для объединения строковых литералов и переменных.

?>