<?php
$a=2;присваеивает значение переменной$a=2 целое число 2
$b=2.0;присваивает переменой$b число с плавающей точкой 2.0
$c='2';присваивает переменной $c строку'2'
$d='two';присваивает переменной $d строку "two"
$g=true;присваивает переменной $g булево значение true
$f=false;присваеивает переменной $f булево значение false
$result=$c.$a;переменной $result присваивается реультат соединения значения переменной
$result2=$c.$b;присваеивает результат соединеия значения переменной
$result3=$c.$d;присваивает новое значение результат соединения значения переменной
echo $result3;вывод значения переменой