<?php
$a=2;создается переменная со значением  2
$b=2.0;создается переменная со значением   2.0
$c='2';создается переменная со значением  "2"
$d='two';переменная со значением "two"
$g=true;переменная со значеием "истина"
$f=false;переменная со значеием"ложь"
$result=$c.$a;создается перемнная в которую помещаются резултат соединения строки
$esult2=$c.$b;создается переменная в которую помещается результат соединеия строки
$result3=$c.$d;создается переменная в которую помещается результат соединения строки
echo $result3;вывод на экран переменной
?>