<?php
$a=2;создается переменная $a со значением 2
$b=2.0;создается переменная $b ей присвавается значение с плавающей точкой 2.0
$c='2';создается переменная $c ей присваивается строка '2'
$d='two';создается переменная $d ей присваивается строка 'two'
$g=true;создается перемнная $g ей присваивается логическое значение true(истина)
$f=false;создается переменная $f ей присваивается логическое значение false(ложь)
$result=$a+$b;выполняется сложение переменных
$esult2=$g+$b;выполняется сложение переменных
$result3=$g-$b;выполняется вычитание переменных
echo $result3;вывод текста на экран