<?php
$a=2;   Объявляется переменная $a  Ей присваивается целое число 2.
$b=2.0;   Объявляется переменная $b  Ей присваивается целое число 2.0
$c='2';Объявляется переменная $c  Ей присваивается строка '2'. Важно, что, хотя это и цифра, она заключена в кавычки, что делает её строкой, а не числом.
$d='two';  Объявляется переменная $d  Ей присваивается строка 'two'.
$g=true;Объявляется переменная $g  Ей присваивается логическое значение true (истина)
$f=false;Объявляется переменная $f Ей присваивается логическое значение false (ложь).
$result=$a+$c;Выполняется сложение переменных $a и $c
$esult2=$a*$c;  Выполняется умножение переменных $a и $c.
$result3=$a+$g;Выполняется сложение переменных $a и $g.
echo $result3;Эта строка выводит на экран значение переменной $result3.
?>